app/views/orders/show.html.erb

      <% @orders.each do |order| %>
        <% product = Product.find_by(id: order.id_product) %>
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]