app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 2]]
---
    def index
        @orders = current_user.orders

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 2]]
---
    def show
        @orders_user = current_user.order

INSERT INTO "orders" ("user_id", "id_product", "status", "description", "order_date", "created_at", "updated_at", "id_user") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @order = current_user.orders.build(order_params)

        if @order.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def update
        @user = User.find(params[:id_user])