app/controllers/reviews_controller.rb

    def index
        @reviews = Review.where(id_user: current_user.id)
---
SELECT "reviews".* FROM "reviews" WHERE (id_user = 3)

    def create
        @review = Review.new(review_params)

        if @review.save
---
INSERT INTO "reviews" ("content", "grade", "created_at", "updated_at", "id_user", "id_product") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "buen producto"], ["grade", 5.0], ["created_at", "2023-04-24 00:41:26.543688"], ["updated_at", "2023-04-24 00:41:26.543688"], ["id_user", 3], ["id_product", 1]]

    def new
        @review = Review.new
        @order = Order.find(params[:id_order])
        @product = Product.find(params[:id_product])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]