app/views/reviews/index.html.erb

      <% @reviews.each do |review| %>
        <% product = Product.find_by(id: review.id_product) %>
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]